Autodesk.Revit.DB.LinkElementId.HostElementId
The id of the element in the host, or invalidElementId if there is a link.
Since: 2012

Autodesk.Revit.DB.LinkElementId.LinkedElementId
The id of the element in the link, or invalidElementId if no link.
Since: 2012

Autodesk.Revit.DB.LinkElementId.LinkInstanceId
The id of the link, or invalidElementId if no link.

Autodesk.Revit.DB.LinkElementId.op_Inequality(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.LinkElementId)
Determines whether these two LinkElementIds are different.
first: The first LinkElementId.
second: The second LinkElementId.
Returns: True if the LinkElementIds are different; otherwise, false.

Autodesk.Revit.DB.LinkElementId.op_Equality(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.LinkElementId)
Determines whether these two LinkElementIds are the same.
first: The first LinkElementId.
second: The second LinkElementId.
Returns: True if the LinkElementIds are the same; otherwise, false.

Autodesk.Revit.DB.LinkElementId.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.LinkElementId.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new LinkElementId representing an element in a linked document.
linkInstanceId:  The id of the linked model element in the host document.
elementId:  The id of the element in the linked model document.
Since: 2011

Autodesk.Revit.DB.LinkElementId.#ctor(Autodesk.Revit.DB.ElementId)
Creates a new LinkElementId representing an element in the host document.
elementId:  The id of the element in the host document.
Since: 2011

Autodesk.Revit.DB.LinkElementId
LinkElementId represents an element in a linked document.
Remarks:
The id contains two element ids:
The id of the linked model element in host document.The id of the element in the linked model document.
Since: 2011